{
  "blog": [
    {
      "title": "សម្ដេចវិបុលសេនាភក្តី សាយ ឈុំ ផ្ញើលិខិតជូនពរ សម្ដេចធម្មវិសុទ្ធវង្សា សៅ ទី ហេងសំរិន ក្នុងឱកាសចម្រើនជន្មាយុ",
      "body": "(ភ្នំពេញ)៖ សម្ដេចវិបុលសេនាភក្តី សាយ ឈុំ ប្រធានរដ្ឋព្រឹទ្ធសភាកម្ពុជា នៅថ្ងៃទី២២ ខែកុម្ភៈ ឆ្នាំ២០២២នេះ បានផ្ញើលិខិតជូនពរ សម្ដេចធម្មវិសុទ្ធវង្សា សៅ ទី ហេង សំរិន ក្នុងឱកាសចម្រើនជន្មាយុប្រកបដោយពរជ័យសិរីមង្គលមហាប្រសើរដ៏ថ្លៃថ្លា នៅថ្ងៃនេះ។\n\nក្នុងលិខិតរបស់ សម្តេចវិបុលសេនាភក្តី សាយ ឈុំ ផ្ញើជូនសម្ដេចធម្មវិសុទ្ធវង្សា សៅ ទី ហេង សំរិន បានលើកឡើងថា «ខ្ញុំ និងភរិយា មានសេចក្តីសោមនស្សរីករាយ សូមសម្តែងនូវអំណរសាទរ ប្រកបដោយមនោសញ្ចេតនាគោរពស្រឡាញ់រាប់អានចំពោះ សម្តេច សូមទទួលបាននូវសុខភាពល្អមាំមួន បញ្ញាញាណភ្លឺថ្លា ប្រាជ្ញាឈ្លាសវៃ និងមានអាយុយឺនយូរ»។\n\nសម្តេចវិបុលសេនាភក្តី សាយ ឈុំ បានបន្ដថា «ខ្ញុំ និងភរិយា សូមថ្លែងនូវការគោរពកោតសរសើរដោយស្មោះជូន សម្តេចដែលជាឧត្តមភរិយា ប្រកបដោយព្រហ្មវិហារធម៌ គុណធម៌ដ៏ប្រពៃ ហើយតែងតែលះបង់កម្លាំងកាយចិត្ត ប្រាជ្ញាស្មារតី និងពេល វេលាដ៏មានតម្លៃរួមចំណែកយ៉ាងធំធេងបម្រើឧត្តមប្រយោជន៍ ជាតិ សាសនា ព្រះមហាក្សត្រ និងគាំទ្រយ៉ាង ខ្លាំងដល់ សម្តេចអគ្គមហាពញាចក្រី ក្នុងការរំដោះជាតិ ក៏ដូចជាការកសាងសង្គមជាតិ ជាពិសេស ក្នុង ការដឹកនាំស្ថាប័នរដ្ឋសភាជាតិ អោយទទួលបានសុខសន្តិភាព ស្ថិរភាព និងរីកចម្រើនរហូតមកដល់សព្វថ្ងៃ។\n\nសម្តេចបានបន្តទៀតថា៖ «ជាថ្មីម្ដងទៀត ខ្ញុំ និងភរិយា សូមបួងសួងដល់វត្ថុស័ក្តិសិទ្ធិទាំងអស់ក្នុងលោក គុណបុណ្យព្រះរតនត្រៃកែវទាំងបី ព្រមទាំងទេវតារក្សាព្រះរាជាណាចក្រកម្ពុជា សូមមេត្តារក្សាប្រោះព្រំពរជ័យជូន សម្ដេច ធម្មវិសុទ្ធវង្សា សៅ ទី ហេង សំរិន និង សម្តេចអគ្គមហាពញាចក្រី ហេង សំរិន ព្រមទាំងបុត្រា បុត្រី ចៅ ប្រុស ចៅស្រីទាំងអស់ សូមបានសមប្រកបដោយព្រះពុទ្ធពរទាំងបួនប្រការគឺ អាយុ វណ្ណៈ សុខៈ ពលៈ កុំបី ឃ្លៀងឃ្លាតឡើយ»៕",
      "author": "Doeun Kongden",
      "id": 2
    },
    {
      "title": "Times they are a changin",
      "body": "Major changes have recently occured in my life, both personally and professionally. We're approaching five years since the inception of this blog, and going back to read the posts from May '04 is quite the experience. I suppose its what diaries and journals are for, the chance to go back and read out your thoughts and ideas from another time. Kind of like mental time travel.\n\nOne thing is for sure, I am not who I was then. In fact, I am not who I was last year or the year before that. I may have some (we shed and create a lot of cells frequently) of the bodily composition of that person but we are definitely on different wavelengths.\n\nThis whole blogging business started off as a documentation of odd and quirky ideas I might have. I had a lot of time on my hands back then, hence the frequency of the posts. With time, the posts have decreased in number but have also slightly sharpened in focus. They may still be random and don't generally adhere to one unified theme, but this thing was meant to be disjointed and arbitrary anyway.\n\nI know blogging has pretty much gone out of style these days, but I never meant for this to be stylish. The more I read my old posts, the more I believe that continuing to write here if only to be able to re-read it later is worthwhile. These next few lines (in no particular order) are for future perusing:\n\n- United are in the Champions league final against Barcelona for a shot at retaining the cup. I believe we are going to win. Did we? I hope it was a good game.\n\n- You've just moved out of home and are currently adjusting to having your own family. Its terrifying and exciting all at once. Having more or less settled now, you have found that through all of this you've discovered that you have an affinity for furniture shopping. Who would've thunk it.\n\n- You're starting studying for your MRCS part B soon. The plan is to pass it first time. I hope that reading this in the future, you remember how it felt to be looking ahead to that. I also hope that you passed.\n\n- You have accumulated a bit of debt, but are confident of repaying it all very soon. I hope that when you re-read this, it will have been replaced by a good amount of savings.\n\n- You are still basking in the glory of having had the best wedding of all time.\n\n- One and a half years in your current job and counting. Still on track with the initial estimate of two to three years in Bahrain followed by training abroad. So, how did that work out then?\n\n- 1st on call, sleepless nights at the hospital working a 1 in 4 rota. Not so bad, considering what you've been through. I hope that when you read this you have had a hell of a lot more experience in operating and are no longer at junior level.\n\nA few more personal things I could've documented here, but I'd rather leave them out of the public arena. Have to run now, but I hope that list makes for interesting reading at some point down the line.",
      "author": "Axie Infinity",
      "id": 3
    },
    {
      "title": "Eureka",
      "body": "I've always had a thing against Landon Donovan. The tag of \"best US soccer player of his generation\" rang a bit hollow when you looked at what he's achieved on a global scale. His two aborted attempts at Bayer Leverkusen in Germany really frustrated me.\n\nYou see, the guy has undeniable skill. He might not be considered world class per se, but he definitely is the best player in the MLS pre-Beckham by a country mile. If he had stuck with it and tried to develop himself in Europe at an earlier age, I believe he would've achieved much more and became a far better player than he is today.\n\nWhat I find really irritating wasn't that he had tried to play at a club and failed, it was the manner of his failure. It wasn't based on not being good enough to get into the first team. It wasn't about a bad atmosphere or a league that was too difficult for him. It was his inability or unwillingness to experience life outside of the US. His first stint in Germany was at a very young age (16, I think), and he struggled to adapt to life in Europe and so he was allowed to go back on loan to the MLS until he matured enough to be able to handle the situation. In San Jose he prospered, and was consistently the best performer on a mediocre team. He publicly spoke about his nightmare in Germany and not being able to cope with the move away from the US.\n\nThen came the second stint at the age of 23. Bayer Leverkusen wanted a player of his calibre back to contribute, and he was forced to leave the US again. Once again, he failed to adjust to his surroundings and a move back to the MLS and the LA Galaxy followed suit. I was really disappointed to hear about it at the time, since I thought that surely Germany cannot be THAT bad? And even if its not exactly where he'd like to live, it is more than simply a positive career step and going back the mediocrity of the MLS was the least ambitious thing I have ever heard of.\n\nMy friends struggled to see why I was so upset. Surely he had a right to choose where he wanted to live? My grief was in the fact that he was living my dream and making a mess of it. He had the talent to be a world class player, he was a professional footballer with everything he ever wanted.. and he couldn't leave the comfort zone of \"America, the Best Place on Earth\".\n\nLandon came out recently and said that he is now dreaming of a move to Spain or England. He recognises that his game would improve drastically over in Europe, but he's unsure now whether any club would sign him after his antics in Germany. He's finally matured enough to think with a professional mindset.. but he's almost 27 now, and a lot of time was lost where he could've further honed his craft in more competitive surroundings.\n\nAs a person, I don't know Mr. Donovan and have little regard to how his life turns out to be. Its the concept that bothers me, the fact that his reluctance to put some pressure on himself to further improve on his God given talent stems from his inability to leave the US cocoon. When I first went to university, my roommate who hails from New York asked me why anyone would want to live anywhere but the United States. His lack of geographical orientation astounded me, and I wondered sometimes how many Americans can locate any given country on a map of Europe if presented with the challenge. I'm sure there are many worldly and knowledgable yanks, but the majority seem resistant to the fact that the world holds much more than just the 50 states. My roommate went on to developing a fondness for Europe and a willingness to travel around the world, despite his initial reluctance. It took him 6 years, but he came 'round in the end.. as did all the other Americans who I'm proud to say took a piece of Europe back home with them. May it extend to affect all of the people surrounding them.\n\nSo, Landon, I'm glad that you've finally had your moment of enlightenment. There's more out there than simply the good ol' US of A and the MLS. Time to see if firsthand.",
      "author": "BIT Coin",
      "id": 4
    }
  ]
}